content.org
#+TODO: TODO(t) | DONE(o)
#+HUGO_BASE_DIR: ./
#+HUGO_SECTION: ./
#+title: 麦汁三昧
#+author: mugijiru

*** DONE RPA ちょっとだけ調べてみた
    CLOSED: [2021-04-25 日 23:46]
    :PROPERTIES:
    :EXPORT_FILE_NAME: research-rpa
    :END:

    RPA ちょっとだけ調べてみたのでとりあえず Blog 記事にする。
    ちなみにいくつかリンク張るけど、面倒なのでアフィリエイトとかそういうのにはなってない。
    お金は好きだけど面倒が勝った。

**** モチベーション
     身の回りで RPA 導入するって話があって
     それ聞いて色々思うところがあったから調べてしまった。
     そんで折角調べたんだから世の中に出してしまえ、というぐらいの軽い気持ち。

     そんな軽い気持ちなので、まだどれ1つ試してはいない。

     あと、記事中でやたら Excel のことを気にしているけど、
     自動化してデータ取りたいやつの半分ぐらいは Excel だろっていう偏見があるからです。

**** RPA とは
     わざわざ説明要らない気がするけど一応。

     ロボティクス・プロセス・オートメーションとかいうやつで
     ざっくり言うと「機械に任せて自動化しようぜ」ってやつ。
     あと、プログラマではない人も扱えるようにコードは書かないとか、
     昔からある画面自動操作とちょっと違って、仮想環境上で実行されるとかあるっぽい。
     ま、細かいことは知らん。
     動きゃいいんだよ動きゃ。

**** RPA の分類

     ざっくりと

     - スタンドアローン型
     - オンプレミス型
     - クラウド型

     と分かれる。

***** スタンドアローン型

      デスクトップ型とも言われるやつ。
      一台のマシンにインストールしてその中で完結するタイプ。
      感覚的には一番わかりやすいんじゃないかな。
      RDA(ロボティクス・デスクトップ・オートメーション)と呼んで他と区別されることもあるらしい。

      各個人のマシンにインストールして動かすので操作対象の制限が少なく
      個人作業の効率化に向いている。

      インストールして使うタイプなので、大体 OS の制限がある。
      っていうか Windows で使ってくださいって言われる印象がある。

      仕組みが単純だからなのか比較的安価なのが多いっぽい。
      とはいえ、大体初期導入で20万円とか30万円とか取られて
      月々10万円取られる、みたいなのがお約束。

      で、個人の作業の効率化には向いているけど、
      会社全体とか部署全体の効率化のために
      他の人が作ったシナリオを流用したい、みたいなのには向かない。
      だって各個人のマシンに入れるものですし。

      それを回避するために、
      こいつを自社管理サーバ(オンプレでも AWS でも)にインストールして、
      1アカウントを使い回してリモートデスクトップでアクセスして操作する、
      みたいなのはバカげた考えなのでやめた方がいい。

      共通アカウントって時点でセキュアじゃないし、
      誰かのロボットが動いていると自分の処理が動かせないので待ちが発生するし、
      サーバの管理コストも発生するしでコストメリットに対するデメリットがでかいはず。
      導入しようとしている人にそれが理解できるか知らんけど。

***** オンプレミス型

      サーバ型とも言われるやつ。
      オンプレサーバにインストールしてみんなで使うみたいな用途向け。

      オンプレサーバに入れるので

      - 情報が社外に流出しないようにしたい
      - イントラネットのサーバにアクセスしたい
      - 使用状態の監視をしたい

      みたいなことを要求しがちな大企業でも導入しやすそうな気がしている。

      一方で、オンプレサーバに入れるとなるとサーバ管理コストも発生するし、
      多分仕組み上お値段もお高めになるかなって気はしている。

      オンプレミス型とは書いているけど
      別に AWS EC2 上で動かしても問題はないはず。
      イントラネットに閉じる、みたいなのとはズレてくるからメリットが薄れそうだけど。

      正直3分類の中で一番興味ないのでほとんど調べてない。
      つまりできないこととかもよくわからん。

      多分、サーバにはサーバソフトウェアを入れた上で、
      各自のマシンにはクライアントソフトウェアを入れて、それ経由でサーバにアクセスして、
      実際の処理は各自のマシンで実行される仕組みにしているんじゃないかな。
      じゃないと大企業で大事な Excel などの操作もできなさそう(やりにくそう)だし。

***** クラウド型

      みんな大好きクラウド環境で動くタイプ。
      クラウド環境で動くので、使用場所を問わないし管理もしやすいやつ。
      ほっといても運営がどんどん機能追加してくれるしね。多分。

      ブラウザ上で完結している場合は Excel などの操作はできないが、
      それを解決するために別途クライアントをインストールする、というタイプもある。

      ただ、多分クライアントソフトの開発にそれほどリソースが割けないので
      対応ソフトウェアが多くはない、ということもありそう。
      まあ時代はクラウドなので今時 Excel などのローカル環境で動くソフトウェアなんて使いませんよねハハハ。

      オンプレ型と違ってサーバ管理コストは発生しないので
      エンジニアの端くれとしてはオンプレ型よりこっちの方が好み。
      だって情シスでもないのにサーバ管理させられたくないっしょ。通常業務が滞る。

      サービス終了となった時に全部動かなくなってつらいことになりそうなので
      クラウド型を選択する時は人気度にも気をつけた方がいいかもしれない。
      それ以外のタイプでもサポート終了したら色々困りそうだけど、
      即座に動かなくなるわけではないはずなので、まだマシそう。

**** どのタイプを使うべきか

     用途による。

     とだけ書いてもしょうがないので、ちょっと主観で述べると、
     とりあえず基本的にはクラウド型にしとく方が良さそうな気がする。

***** 会社単位・部署単位での導入の場合

      会社全体や部署全体の効率化観点だと、
      どうせ「このシナリオをみんなが使えるようにしたい」みたいになるので
      最初からそういう用途があることを折り込んでおいた方が良さそう。

      となるとオンプレ型かクラウド型になるけど、
      オンプレサーバの管理とかしたくないじゃん? じゃあクラウド型じゃん?

      管理コストとかより情報流出対策とかの方が大事な方は、オンプレ型になる気がする。
      あとはイントラネットへのアクセスが必要だったらクラウド型は厳しいかも。

***** 個人での導入の場合

      個人用途だと
      わざわざオンプレ型にして無駄に管理の手間や利用料金を増やしたい酔狂なやつ以外は
      スタンドアローン型かクラウド型になると思う。

      で、個人だと色々自由なはずなので
      使うソフトウェアは基本的にクラウドアプリケーションに寄せておいたら、
      スタンドアローン型のメリットである、ローカル環境の操作は不要になるかなと。

      また、クラウド型にしておいたら、
      PC を買い替えた時とかもインストールし直しとかデータ移行とかも不要で便利。
      いや、ローカルクライアントも必要なやつだとインストールし直しは発生するけども。

      もしローカル環境の自動化をしたいとか、イントラネットにアクセスしたいとか、
      クラウドサービスの利用は諸々の制限がある場合はスタンドアローン型になるかなって気はする。
      けど、そういうところソフトウェアのインストールにも制限がありそう(偏見)。

**** その他、気にした方がいいポイント
***** 機能面
      各会社がシノギを削ってるのでそれぞれの製品毎に強みがあったりする。

      例えば、AI による判定機能が入ってるとか、
      素人でも簡単にロボットが作れちゃうとか、
      複雑な操作までできることが売りのやつとかもある。

      そのあたりは、各自が自分のスキルレベルとかやりたいことに合わせて検討して欲しい。
      というか、そこまで調べる元気はなかった。
      あと AI がどうのこうのってやつはそもそも信用してなかったりするので、売り文句を見てると苦痛だった。

***** お値段

      大事だよね〜お値段。お高いの厳しいもんね。
      まあ、安くてもやりたいことができないんじゃあ導入する意味はないので
      機能重視で考えた方がいいと思うよ。

      ちなみに大体のやつは月額10万円からで初期費用は別途30万とかの世界なので
      私としては「高い……無理……」ってなるんだけども。
      ギョームソフトウェアってお高いね。

      個人的には、基本サービスは安いけど、
      つい頼みたくなるような便利な追加オプションがあるような料金設定はニクいなって思う。

***** やめやすさ

      導入してみてダメだった時のことを考えると
      やめやすさは考慮に入れておいた方がいいと思うの。

      例えば、シナリオのエクスポート機能があって、それを他の RPA に取り込むことができると嬉しいよね。
      そんなのをサポートしている RPA があるって聞いたことないけど。
      互換性の維持とか厳しそうだしな。

      あとは契約期間だよね。1年更新とかやめてほしい。
      月額プランと年契約プランで後者は割安、とかならいいけど。
      その場合でも解約申請期間がめっちゃ短かいとかわかりにくいとかもやめてほしいよね。

***** 息が長そうか

      せっかく使い続ける選択をしたのに、
      製品サポートそのものが終了してしまったら困るので長く続きそうかってのは大事。

      それをどう判断するかは、ユーザー数が十分いそうか(維持できるだけの収益がありそうか)とか、
      母体が大きいか、とかになるのかなあ。

      個人的にはサービスサイトの表示が微妙なところは、
      そこにコストがかけられない程度に儲かってないんだな、つまり危なそうだな、という気持ちになる。

**** で、具体的にどの製品を使ったらいいのか

     これ、ほんと全然操作したことはなくって、ググって見つかる情報だけで判断しているので
     その前提でよろしくな。

     あと、基本的にケチなので、ほとんど無料プランがあるやつしかリストアップしてない。

***** Coopel

      [[https://coopel.ai/][Coopel]] は DeNA が出しているクラウド型の RPA サービス。
      ローカルクライアントもあって、それを使うとローカルのファイルも扱えたりするやつ。
      少なくともみんな大好きな Excel は扱えるよっ!
      Mac と Windows の両対応なのも嬉しいポイント。

      記事執筆時点だと、1アカウントあたり月額5,400円(税抜)と
      他の RPA サービスに比べるとかなりリーズナブルな感じ。
      最低アカウント数は1アカウントからっぽい雰囲気だし(多分、明示はされてない)

      機能面では、クラウド型がベースなのもあってちょっと弱い気がしている。
      あと、まだ出たばかりのサービスでユーザー数が多くなさそうで、ちゃんと生き残ってくれるか気になる。

      とはいえ国産 RPA だと調べた中では一番好きな感じ。

      他のやつは、クソ高いか「お値段はお問い合わせください」だったり、
      Mac 対応してなかったりするので。

***** UiPath Community Edition

      [[https://www.uipath.com/ja/][UiPath]] は海外の RPA サービスで結構有名っぽいやつ。
      Community Edition だと、個人でも使えるようだし、
      企業でも条件を満たせば無料で使えるようなので小規模事業な各位には良いかもしれない。
      https://www.uipath.com/hubfs/legalspot/JP-UiPath-Specific-Terms-for-Community.pdf

      Automation Cloud とかいうクラウド型のやつとか、色々な機能が使えるっぽい。

      機能も豊富らしいが、その分複雑なので素人には難しい、みたいな意見も見かけた。
      あと海外製なので日本人には英語がつらそう、
      と思ってたけど日本語化されてるのでそこは割とつらくないかもしれない。

      どの程度きっちり日本語化されてるかはわからないけど、
      ざっくり Qiita を見た感じだと割とちゃんとされてそうな雰囲気。

      あとは、海外製なので UI が日本人には合わない可能性はありそう。
      使ったことないから知らんけど。

      機能とかとは関係ないけど、公式サイトの英語版と日本語版の違いがちょっと面白い。

***** Automation Anywhere Community Edition

      [[https://www.automationanywhere.com/jp/][Automation Anywhere]] も海外製で有名っぽいやつ。
      学生や開発者、或いは小規模事業者なら無償の Community Edition が使えるとのこと。
      クラウド型の機能とかなんだとか、結構色々な機能を使える。

      こっちも日本語化は一応されてるが、
      [[https://qiita.com/RPAbot/items/2a2d94eeab641dfa6516][Qiita の記事]] を見た感じだと、英語の部分も残ってそうな雰囲気。
      英語となると苦しい人達には厳しいかもしれない。

      UiPath に比べるとライセンスがちょっと厳しい印象。
      https://www.automationanywhere.com/jp/community-edition-license-agreement-a2019

      特に利用台数が限られてるので、
      複数台マシンを所持していて、どっちからでも実行したい時とか、
      移行したい時とか困らないかなってお気持ち。

***** Power Automate Desktop

      [[https://flow.microsoft.com/ja-jp/desktop/][Power Automate Desktop]] は Microsoft が出してるやつで
      割と最近 Windows 10 ユーザーなら無料で使えるようになったやつ。
      Power Automate シリーズの1つなので、
      多分、もっと便利に使いたくなった時に、
      そのシリーズの他の製品との連携もスムーズにできるんじゃないかなってやつ。

      MS なので、多分息も長いし、
      Windows で個人用途でデスクトップ型で構わないなら
      まずはこれを試しておけって気がするやつ。無料なので。
      MS だから Excel も当然使えるしなっ!

***** Automator

      Mac 買ったら入ってるやつですね。なので実質無料。
      とりあえず Mac で RPA 的なことをしたかったらこれ使ってけば良いのでは、と思ってる。

      Excel なんかは対応してなかったりするのが微妙なところ。

**** 最後に

     個人的にはコードを書きたいので RPA あんまり入れる気がしないでござる。
     テスタビリティなさそうだし。
     NoCode での開発ツールに対する自動テストみたいな、
     コード書かない縛りプレイの時に使うかも、ぐらいのお気持ち。

